<template>
  <div class="modal-body">
    <div class="img-wrapper">
      <img src="./../../img/privacy-policy.png" alt="">
    </div>

    <div class="modal-text">
      <h2>Політика щодо обробки персональних даних</h2>

      <h3>1. Загальні положення</h3>
      <p>Дана Політика конфіденційності, далі — Політика, діє щодо обробки
        персональних даних, які може отримати сайт <a
            href="https://dnepr-class.com.ua"
            target="_blink">dnepr-class.com.ua</a>
        (далі – Оператор) від фізичних осіб (суб'єктів персональних даних) на
        підставі
        Конституції України та Закону України “Про захист персональних даних”
        від 01.06.2010 р. №2297-VI (далі — Закон), а також Генерального
        регламенту про захист даних (ЄС) 2016/679 від 27.04.2016 р. (EU General
        Data Protection Regulation, далі — GDPR) та іншого застосованого
        Європейського законодавства про захист даних, що називається далі -
        Законодавство.
      </p>
      <p>Оператор ставить своєю найважливішою метою та умовою здійснення своєї
        діяльності дотримання прав та свобод людини та громадянина при обробці
        його персональних даних, у тому числі захисту прав на недоторканність
        приватного життя, особисту та сімейну таємницю.
        Ця політика Оператора щодо обробки персональних даних (далі – Політика)
        застосовується до всієї інформації, яку Оператор може отримати про
        відвідувачів веб-сайту <a href="https://dnepr-class.com.ua"
                                  target="_blink">dnepr-class.com.ua</a></p>

      <h3>2. Основні поняття, що використовуються у Політиці</h3>
      <p>Автоматизована обробка персональних даних - обробка персональних даних
        за допомогою засобів обчислювальної техніки;
        Блокування персональних даних – тимчасове припинення обробки
        персональних даних (крім випадків, якщо обробка необхідне уточнення
        персональних даних);
        Вебсайт – сукупність графічних та інформаційних матеріалів, а також
        програм для ЕОМ та баз даних, що забезпечують їх доступність у мережі
        інтернет за мережевою адресою <a href="https://dnepr-class.com.ua"
                                         target="_blink">dnepr-class.com.ua</a>;
        Інформаційна система персональних даних — сукупність персональних даних,
        що містяться в базах даних, і забезпечують їх обробку інформаційних
        технологій та технічних засобів;</p>

      <p>Знеособлення персональних даних — дії, у яких неможливо визначити без
        використання додаткової інформації належність персональних даних
        конкретному Користувачеві чи іншому суб'єкту персональних даних;
        Обробка персональних даних – будь-яка дія (операція) або сукупність дій
        (операцій), що здійснюються з використанням засобів автоматизації або
        без використання таких засобів з персональними даними, включаючи
        збирання, запис, систематизацію, накопичення, зберігання, уточнення
        (оновлення, зміну), вилучення, використання, передачу (розповсюдження,
        надання, доступ), знеособлення, блокування, видалення, знищення
        персональних даних;
      </p>

      <p>Оператор – державний орган, муніципальний орган, юридична або фізична
      особа, що самостійно або спільно з іншими особами організовують та (або)
      здійснюють обробку персональних даних, а також визначають цілі обробки
      персональних даних, склад персональних даних, що підлягають обробці, дії
      (операції), що здійснюються із персональними даними;
      Персональні дані – будь-яка інформація, що відноситься прямо або
      опосередковано до певного або визначеного Користувача вебсайту
      <a href="https://dnepr-class.com.ua"
         target="_blink">dnepr-class.com.ua</a>;
      </p>
      <p>Користувач – будь-який відвідувач сайту <a
          href="https://dnepr-class.com.ua"
          target="_blink">dnepr-class.com.ua</a>;

        Надання персональних даних – дії, створені задля розкриття персональних
        даних певному особі чи певному колу осіб;
        Поширення персональних даних – будь-які дії, спрямовані на розкриття
        персональних даних невизначеному колу осіб (передача персональних даних)
        або на ознайомлення з персональними даними необмеженого кола осіб,
        зокрема оприлюднення персональних даних у засобах масової інформації,
        розміщення в інформаційно-телекомунікаційних мережах або надання доступу
        до персональних даних будь-яким іншим способом;
        Транскордонна передача персональних даних – передача персональних даних
        на територію іноземної держави органу влади іноземної держави, іноземній
        фізичній чи іноземній юридичній особі;</p>
      <p>
        Знищення персональних даних – будь-які дії, внаслідок яких персональні
        дані знищуються безповоротно з неможливістю подальшого відновлення
        змісту персональних даних в інформаційній системі персональних даних та
        (або) внаслідок яких знищуються матеріальні носії персональних даних.
      </p>

      <h3>3. Оператор може обробляти такі персональні дані Користувача</h3>
      <p>Прізвище ім'я по батькові;
        Номери телефонів;
        Також на сайті відбувається збір та обробка знеособлених даних про
        відвідувачів (в т.ч. файлів cookie) за допомогою сервісів
        інтернет-статистики (Яндекс Метрика та Google Аналітика та інших).
        Дані за текстом Політики об'єднані загальним поняттям Персональні
        дані.</p>

      <h3>4. Цілі обробки персональних даних</h3>
      <p>Мета обробки персональних даних Користувача - укладання, виконання та
        припинення цивільно-правових договорів.
        Також Оператор має право надсилати Користувачеві повідомлення про нові
        продукти та послуги, спеціальні пропозиції та різні події. Користувач
        завжди може відмовитися від отримання інформаційних повідомлень,
        надіславши Оператору лист на адресу електронної пошти info@
        <a href="https://dnepr-class.com.ua"
           target="_blink">dnepr-class.com.ua</a> з позначкою «Відмова від
        повідомлень про нові
        продукти та послуги та спеціальні пропозиції».
        Знеособлені дані Користувачів, які збираються за допомогою сервісів
        інтернет-статистики, служать для збору інформації про дії Користувачів
        на сайті, покращення якості сайту та його змісту.</p>

      <h3>5. Правові основи обробки персональних даних</h3>
      <p>Оператор обробляє персональні дані Користувача лише у разі їх
        заповнення та/або відправлення Користувачем самостійно через спеціальні
        форми, розташовані на сайті <a href="https://dnepr-class.com.ua"
                                       target="_blink">dnepr-class.com.ua</a>.
        Заповнюючи
        відповідні форми та/або надсилаючи свої персональні дані Оператору,
        Користувач висловлює свою згоду з цією Політикою.
        Оператор обробляє знеособлені дані про Користувача у випадку, якщо це
        дозволено в налаштуваннях браузера Користувача (включено збереження
        файлів cookie та використання технології JavaScript).</p>

      <h3>6. Порядок збирання, зберігання, передачі та інших видів обробки
        персональних даних</h3>
      <p>Безпека персональних даних, що обробляються
        Оператором, забезпечується шляхом реалізації правових, організаційних та
        технічних заходів, необхідних для виконання у повному обсязі вимог
        чинного законодавства у сфері захисту
        персональні дані.

        Оператор забезпечує збереження персональних даних та вживає всіх
        можливих заходів, що виключають доступ до персональних даних не
        уповноважених осіб.
        Персональні дані Користувача ніколи, за жодних умов не будуть передані
        третім особам, за винятком випадків, пов'язаних із виконанням чинного
        законодавства.
        У разі виявлення неточностей у персональних даних, Користувач може
        актуалізувати їх самостійно шляхом надсилання Оператору повідомлення на
        адресу електронної пошти Оператора info@memories.dp.ua з позначкою
        «Актуалізація персональних даних».
        Термін обробки персональних даних є необмеженим. Користувач може
        будь-якої миті відкликати свою згоду на обробку персональних даних,
        надіславши Оператору повідомлення за допомогою електронної пошти на
        електронну адресу Оператора <a href="https://dnepr-class.com.ua"
                                       target="_blink">dnepr-class.com.ua</a> з
        позначкою «Відгук
        згоди на обробку персональних даних».</p>

      <h3>7. Транскордонна передача персональних даних</h3>
      <p>Оператор на початок здійснення транскордонної передачі
        персональних даних зобов'язаний переконатися, що іноземним
        державою, на територію якої передбачається здійснювати
        передачу персональних даних, забезпечується надійний захист прав
        суб'єктів
        персональні дані.
        Транскордонна передача персональних даних на території
        іноземних держав, які не відповідають вищевказаним вимогам, може
        здійснюватись лише у разі наявності згоди у письмовій формі
        суб'єкта персональних даних на транскордонну передачу
        його персональних даних та/або виконання договору, стороною
        якого є суб'єктом персональних даних.</p>

      <h3>8. Заключні положення</h3>
      <p>Користувач може отримати будь-які роз'яснення щодо питань, що
        стосуються обробки його персональних даних, звернувшись до Оператора за
        допомогою електронної пошти <a href="https://dnepr-class.com.ua"
                                            target="_blink">info@dnepr-class.com.ua</a>.
        У цьому документі буде відображено будь-які зміни політики обробки
        персональних даних Оператором. Політика діє безстроково до заміни її
        новою версією.
        Актуальна версія Політики у вільному доступі розташована в Інтернеті
        за адресою <a href="https://dnepr-class.com.ua" target="_blink">dnepr
          -class.com.ua/privacy</a>.
      </p>

    </div>
  </div>
</template>

<script>
export default {
  name: "PrivacyPolicy"
}
</script>

<style lang="scss" scoped>
@import url('https://fonts.googleapis.com/css2?family=Roboto:wght@100;400;500;700&display=swap');

.modal-body {
  font-family: 'Roboto', sans-serif;
}

img {
  max-width: 100%;
}
</style>